sysbench/results/aws/vitess/media/parallel/read_5.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            16534
        write:                           0
        other:                           0
        total:                           16534
    transactions:                        1181   (18.97 per sec.)
    queries:                             16534  (265.60 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          62.2386s
    total number of events:              1181

Latency (ms):
         min:                                  657.36
         avg:                                 2590.78
         max:                                 5345.09
         95th percentile:                     4517.90
         sum:                              3059705.58

Threads fairness:
    events (avg/stddev):           23.6200/12.25
    execution time (avg/stddev):   61.1941/0.69